[
  {
    "id": 0,
    "text": "Two SQL tables sit at the bar. A query approaches and asks 'Can I join you?'"
  },
  {
    "id": 1,
    "text": "I was struggling to figure out how lightning works, but then it struck me."
  },
  {
    "id": 2,
    "text": "The generation of random numbers is too important to be left to chance."
  },
  {
    "id": 4,
    "text": "Java and C were telling jokes. It was C's turn, so he writes something on the wall, points to it and says 'Do you get the reference?' But Java didn't."
  },
  {
    "id": 5,
    "text": "If Bill had a dime for every time Windows crashed ... Oh wait, he does."
  },
  {
    "id": 6,
    "text": "Have a great weekend! I hope your code behaves the same on Monday as it did on Friday."
  },
  {
    "id": 7,
    "text": "Knock knock. Who's there? Recursion. Recursion who? Knock knock."
  },
  {
    "id": 8,
    "text": "How do you tell HTML from HTML5? - Try it out in Internet Explorer - Did it work? - No? - It's html5."
  },
   {
    "id": 9,
    "text": "Why do Java developers wear glasses? Because they don’t C#."
  },
  {
    "id": 10,
    "text": "A programmer’s wife tells him, 'Run to the store and pick up a loaf of bread. If they have eggs, get a dozen.' He comes home with 12 loaves of bread."
  },
  {
    "id": 11,
    "text": "There are only 10 types of people in the world: those who understand binary, and those who don’t."
  },
  {
    "id": 12,
    "text": "Why did the programmer quit his job? Because he didn’t get arrays."
  },
  {
    "id": 13,
    "text": "How many programmers does it take to change a light bulb? None, that's a hardware problem."
  },
  {
    "id": 14,
    "text": "To understand recursion, one must first understand recursion."
  },
  {
    "id": 15,
    "text": "A SQL query walks into a bar, walks up to two tables and asks: 'Can I join you?'"
  },
  {
    "id": 16,
    "text": "Why was the JavaScript developer sad? Because he didn’t know how to 'null' his feelings."
  },
  {
    "id": 17,
    "text": "Why did the computer show up at work late? It had a hard drive."
  },
  {
    "id": 18,
    "text": "Debugging: Being the detective in a crime movie where you are also the murderer."
  }
]
